Revit 2024 API
MacroModuleIterator.Dispose Method
Releases all resources used by the MacroModuleIterator
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
See Also
MacroModuleIterator Class
Autodesk.Revit.DB.Macros Namespace